{
  "title": "CONTACT USsss",
  "date": "2020-12-17T14:41:45.578Z",
  "image": "/assets/img/uploads/why.jpeg",
  "body": "According to a [Nielson study](http://www.nielsen.com/us/en/insights/news/2013/under-the-influence-consumer-trust-in-advertising.html), 84 percent of people will trust a recommendation made by friends or family (or even acquaintances). Knowing this, Airbnb doubled-down on a way to get their happy customers to recommend their booking platform to their family and friends.\n\nAt first, they simply left the work up to their customers by offering a referral reward for spreading the news. Then they left it alone, letting the news spread organically.\n\nThat is until they realized that their referral program was responsible for millions of dollars in revenue.\n\nWhen they realized this, they decided to devote their time and energy to a referral program that actively sought out referrals.\n\nHow?\n\nThey created a first-of-its-kind email opt-in referral marketing campaign, where users could connect with their existing contacts by sending them an invite to use Airbnb. That’s not all, though.\n\nAirbnb made a specialized API that read contact internet behavior to determine which of the contacts were most likely to need a service like Airbnb and then recommended sending referrals to those contacts only.\n\nWhile this is a little creepy, it proved to be incredibly successful. Then they tested the heck out of the copy, making sure that each part of the referral email was indeed the most successful version of itself.\n\n**Airbnb’s Referral program results:**\n\n* 300 percent increase in referral bookings\n* Referrals booked more reservations than non-referrals\n* Referrals were more likely to become hosts more\n* Referrals even sent more referral invites to their friends and family\n\n**Key Takeaway:** Take the time to evaluate your referral program through A/B testing and understanding your customer base. The better your program, the higher the conversion rate.\n\nSource: <https://www.referralcandy.com/blog/47-referral-programs/#best-practice-referral-programs>",
  "path": "sss",
  "description": "asxasxasx"
}