{
  "date": "2020-12-17T15:13:56.195Z",
  "title": "Your website doesn't have to be WordPress!",
  "image": "/assets/img/uploads/cms.png",
  "body": "WordPress powers almost 25% of the web and those sites running a content management system, it’s closer to 50%.\n\nIt seems like every freelance graphic designer, big agency, and retiree-turned-web-designer is recommending the software as *the* best way to build your website.\n\nBut is it *really?*\n\n## So what’s *wrong* with WordPress?\n\nWell, it depends on who you ask. And more importantly, *what* you plan to use it for.\n\nToday, WordPress can still be an option, but if you’re looking for a fresh approach, the right CMS for *your site* depends on many different factors.\n\nThese are the **biggest drawbacks** for using WordPress:\n\n* Limited Functionality Out of the Box\n* Ancient Architecture\n* Increased Exposure to Hackers\n* Inexperienced Developer Pool\n\n## Limited Functionality Out of the Box\n\nTalk to any WordPress enthusiast and they will tell you it can be used for just about *anything*—from a simple blogging tool to building the next Facebook clone.\n\nHowever, WordPress was *originally* designed to be a simple blogging platform. And it shows.\n\nIn fact, freshly installed, WordPress actually doesn’t really *do* much. If all you want to put a few basic pages up around a blog, it works pretty well.\n\nBut try using it for anything else, such as lead generation, (landing) page design, etc. you start to reach for plugins to extend its functionality. Even staple functionality for Search Engine Optimization including fields for Meta Description and sitemaps are notably absent.\n\nWhile there *is* a vast ecosystem of ready-made plugins and themes, many developers stretch WordPress’ limits a bit too far from what it was originally designed to do: blog.\n\nOftentimes, inexperienced developers will use dozens of different extensions (plugins) to add on functionality they actually didn’t build themselves onto your WordPress site. Now you’re at the mercy of when *those* extra bits of code are updated—or not updated—as well!\n\nIt’s not unlike duct taping wings and a jet engine onto a consumer sedan and using it for commercial airline flights. Unfortunately there’s no (FAA) rules for web designers.\n\n## Ancient Architecture\n\nThere are many different technologies to build a website. Just like computers, programming techniques have also evolved.\n\nMuch of WordPress’ code is still based on older programming techniques which can leave it open to security problems. In fact, hardly a month rolls by without some sort of [security incident](https://blog.sucuri.net/2017/02/wordpress-rest-api-vulnerability-abused-in-defacement-campaigns.html).\n\nAfter all, much of WordPress’ foundation is *over* 10 years old! If you think of WordPress as a home, it’s been patched, re-patched, painted, and drywalled over the years but that old, shaky foundation is ultimately still there. Older editions of these homes have had a few problems in the past with leaky pipes, some electrical issues, creaky foundations, and more.\n\n## Increased Exposure to Hackers\n\nSpeaking of hackers, with so many people using WordPress, staying up-to-date is absolutely critical.\n\nWordPress is a little like moving into an apartment complex on the somewhat “shady” side of town: you’re constantly getting people knocking on your door, jiggling your locks, and trying to find a way to break in.\n\nWhat’s worse, if you ask WordPress nicely, it’ll even give you a list of names off everybody who lives at the apartment—whether they’re listed on the mailbox or not. If someone knows your WordPress username, now all they need is your password.\n\nAnd since WordPress doesn’t block multiple repeated failed attempts to login or let users change where administrators login, it’s not uncommon for automated scripts to troll your website, trying 100s of different passwords at once.\n\nAs you can imagine, this can slow your site down if your [hosting provider](https://ritterknight.com/solutions/web-hosting) isn’t prepared for it.\n\nIt’s not all that uncommon for someone to go on vacation for a week, a critical update comes out and come back to a hacked site! While the WordPress “Core” installation itself has become quite secure over the years—in fact, it even applies its own security updates these days—the same is not true of the plugins that are *needed* to extend WordPress and these are often the most problematic.\n\n## Inexperienced Developer Pool\n\nThere’s actually a pretty wide range of skill levels. The barrier to starting to build a WordPress project is quite small. Just as an experienced contractor can mess up your home, an inexperienced developer can do just as much damage online.\n\nComplicating matters, oftentimes you think you’re hiring an agency when in reality you’re hiring a single person, posing as an agency, with just a couple months experience.",
  "author": "Marcos",
  "tags": "CMS, Website, WordPress"
}