{
  "date": "2020-12-17T15:13:56.195Z",
  "title": "How does a referral program work",
  "image": "/assets/img/uploads/sa.jpeg",
  "body": "### **What is a referral program?**\n\nA referral program is a deliberate, systematic way of getting people to make referrals to your business. It’s often called word-of-mouth marketing because, well, it rewards existing customers for sending new customers to shop with your brand.\n\nThese rewards usually come by way of [referral incentives](https://www.referralcandy.com/blog/referral-program-incentives/), such as major discounts, free cash, or access to an app or program that would otherwise be paid. While there is an upfront cost to the business to cover the cost of the reward, it significantly increases long-term revenue by making loyal customers out of your existing customer base.\n\n### Why do I need a referral program?\n\nOne of the biggest stresses of any business is finding a solid customer acquisition channel, or basically, bringing in new customers. When you have a solid referral marketing program, however, you let your existing customers bring new buyers to your brand. This not only significantly reduces spending on bringing new customers to your shop, but it also increases customer retention, which is a very good thing.\n\nWhy?\n\nBecause [loyal customers have a higher conversion rate](http://success.adobe.com/assets/en/downloads/whitepaper/13926.digital_index_loyal_shoppers_report.pdf) than new customers and [spend more per transaction](https://www.inc.com/guides/2010/08/get-more-sales-from-existing-customers.html), making customer referral programs the most cost-effective AND lucrative marketing strategy that your business can possibly employ.\n\n### **How does a referral program work?**\n\nPeople don’t make as many referrals as they intend to for a variety of reasons. A referral program helps make their mind up with a tangible reward for referrals.\n\nModern referral programs, or a refer-a-friend-program, uses software to track referrals made by happy customers through either a referral code, a rewards card, or a [referral link](https://www.referralcandy.com/blog/how-to-promote-your-referral-program/). Depending on the referral campaign, customers will usually receive some kind of referral bonus or benefit when they refer a friend. Referral marketing software automates the payout of these referral rewards.\n\nThis referral process creates a natural word-of-mouth marketing experience for your brand, which ultimately increases both your [customer retention](https://www.candybar.co/blog/customer-loyalty-program/) rate and your revenue.\n\n### **How do I create a referral program?**\n\nThe best way to bring in potential customers is to first focus on your existing satisfied customers. Rather than just offering cash rewards or free gifts in hopes that your customers will refer a friend to your shop, it takes a little bit of planning to [set up a referral program that works](https://www.referralcandy.com/blog/how-to-setup-referral-program/).\n\n**1. Get Clear About Your Goals**\\\nBefore creating a complex ambassador program or launching tons of marketing campaigns (of any kind), it’s important to be clear about what your goals are for the program. This will help guide you as you brainstorm referral marketing ideas. Some questions to consider are:\n\n* What are you hoping to get out of your rewards program?\n* Do you want more customers? Or just bigger purchases by your existing customers?\n* Are you trying to get a higher conversion rate and increase sales?\n\nYou can certainly achieve each of these goals, but it might require a different referral campaign for each goal. So it’s important to be clear about your goals before beginning.\n\n**2. Make a Life of Your Existing Customer Referral Sources**\\\nYour referral sources are your happy customers, friends and family. They are your biggest advocates and will be the lifeblood of your referral marketing program. Make a list of all of these groups and how you can easily contact them.\n\n**3. Make an Outreach Plan**\\\nNow that you have a list of referral sources, carefully make an outreach plan. It’s not quite as simple as sending a blast email with a generic referral incentive. Instead, research the best practices for reaching out to each type of referral.\n\nNewer customers, for example, shouldn’t receive emails about your reward program right after their first purchase. And close friends and family may not need an incentive at all! The types of referral programs that you use will largely depend on your list, so plan accordingly.\n\n**4. Determine The Referral Incentives You’ll Offer**\\\nWhile cash incentives likely seem like they’ll get the biggest draw out of your existing customer base, that’s not necessarily the case. One study found that non-cash incentives were 24 percent more effective with referral marketing than cash incentives. It’s best to offer something of tremendous value to your customers that will keep them coming back to your shop in the future.\n\n**5. Tell Your Customers About It**\\\nOnce you’ve settled on your referral lists and your incentives, it’s time to get people to spread the word both about your brand and your rewards! There are many different ways to do this, each of which brings in a different segment of potential customers.\n\nYou could add details about your referral program in your newsletters, have opt-ins on your website, or capture customers through a pop-up right on your homepage. Do a little research about the most effective way to grow your lists and then test it out for yourself.\n\n**6. Track The Referrals And Rewards**\\\nIn order to run a successful rewards program, you need to keep track of all of the referrals being made. You need to be able to keep track of who referred whom, the date they were referred, whether or not a conversion was made, and the best way to follow-up with both the referrer and the referee.\n\nOne of the easiest ways to do this is with referral program software, like ReferralCandy, that can do this for you. A system that not only facilitates the reward within your shop but also provides accurate data on the referrals is going to help you know exactly how successful (or unsuccessful) your program is.\n\n### **What are the best referral programs?**\n\nHere is a quick and dirty list that will show you all of the most awe-inspiring referral programs that work. Some of these programs offered free money and others offered subscriptions to their services. Take a look at the most popular successful referral programs to see if any of them spark ideas for your business.\n\n1. [PayPal.](https://www.referralcandy.com/blog/paypal-referrals/) They literally gave away free money, and it worked out great for them. And this was before social media!\n2. [Dropbox.](https://www.referralcandy.com/blog/dropbox-referral-program/) Modeled after PayPal, Dropbox’s referral program got 4 million users in 15 months.\n3. [Airbnb](https://www.referralcandy.com/blog/airbnb-referral-program/). A single user in China led to thousands of signups and hundreds of bookings in a single month.\n4. [Uber](https://www.referralcandy.com/blog/uber-referral-program/). They’ve been in a unique position to run multiple referral programs at once – for both users and for drivers.\n5. [Tesla.](https://www.referralcandy.com/blog/tesla-referral-program/) $1,000 for both advocate and friend, with quite a star-studded list of advocates!\n6. [Amazon Prime.](https://www.referralcandy.com/blog/lessons-from-amazon-primes-referral-program/) Likely one of the most heavily-used referral programs in recent times.\n7. [Google. ](https://www.referralcandy.com/blog/b2b-referral-program-examples-google-apps/)When the front page of the Internet decides to run a referral program, it’s worth looking into.\n8. [Evernote.](https://www.referralcandy.com/blog/evernote-referral-program/) Their referral program relies on a point system.\n9. [Riff Raff & Co.](https://www.referralcandy.com/blog/riff-raff-co-marketing/) From a simple home business, Riff Raff grew to a million-dollar business with word-of-Mum\n\nSource: <https://www.referralcandy.com/blog/47-referral-programs/#best-practice-referral-programs>"
}